src/InformationRegisters/ИС_MP_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_MP_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиДоходов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаказовКлиентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
						<v8:Type>cfg:EnumRef.ИС_МП_МодельРаботы</v8:Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
						<v8:Type>cfg:EnumRef.ВариантыОбеспечения</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Строка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_МП_ДанныеОтладки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_МП_ДанныеОтладки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_МетодыHTTP</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаголовкиЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаголовкиОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_МП_Маркетплейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_МП_Маркетплейсы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Озон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сбер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Али</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ламода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ИС_МП_Сервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область РаботаСФормами

//+ ИнфоСофт Ивонин К.А. 06.07.22 УА #46999
Процедура ПриСозданииНаСервере(ЭтотОбъект) Экспорт
	ЭтотОбъект.Профиль = ИС_МП_СерверПовтИсп.ПрофильПоУмолчанию();	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.07.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #86001
Функция ИнтегрируемыеМаркетплейсы() Экспорт

	ДоступныеМаркетплейсы = Новый Массив;
	ДоступныеМаркетплейсы.Добавить("ВБ");
	ДоступныеМаркетплейсы.Добавить("Озон");
	ДоступныеМаркетплейсы.Добавить("ЯМ");
	ДоступныеМаркетплейсы.Добавить("Сбер");
	ДоступныеМаркетплейсы.Добавить("Али");
	ДоступныеМаркетплейсы.Добавить("МВМ");
	ДоступныеМаркетплейсы.Добавить("Ламода");
	
	Возврат ДоступныеМаркетплейсы;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.10.24 УА #86001

//+ ИнфоСофт Власова И.С. 14.01.25 УА #90120
Функция ИнтегрируемыеМаркетплейсыЦены() Экспорт

	ДоступныеМаркетплейсы = Новый Массив;
	ДоступныеМаркетплейсы.Добавить("ВБ");
	ДоступныеМаркетплейсы.Добавить("Ламода");
	
	Возврат ДоступныеМаркетплейсы;
	
КонецФункции //- ИнфоСофт Власова И.С. 14.01.25 УА #90120

#КонецОбласти

#Область ОбщегоНазначения

//+ ИнфоСофт Ивонин К.А. 23.01.23 УА #53535
Функция ПолучитьUnixTimeStamp(Дата) Экспорт 
	Возврат УниверсальноеВремя(Дата, ИС_МП_СерверПовтИсп.ЧасовойПоясИнформационнойБазы()) - '19700101'; 
КонецФункции //- ИнфоСофт Ивонин К.А. 23.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 23.01.23 УА #53535
Функция ДатаИзUnixTimeStamp(UnixTime) Экспорт 
	Возврат МестноеВремя('19700101' + UnixTime, ИС_МП_СерверПовтИсп.ЧасовойПоясИнформационнойБазы()); 
КонецФункции //- ИнфоСофт Ивонин К.А. 23.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 24.01.23 УА #53535
Функция РазбитьМассивПоNЭлементов(Массив, N) Экспорт

	Результат = Новый Массив;
	
	Если Массив.Количество() < N Тогда
		Результат.Добавить(Массив);
		Возврат Результат;
	КонецЕсли;
	                                                            
	Счетчик = 1;
	ВременныйМассив = Новый Массив;
	
	Для Каждого Элемент Из Массив Цикл
	
		Если Счетчик = N Тогда
		
			Счетчик = 1;
			Результат.Добавить(ВременныйМассив);
			ВременныйМассив = Новый Массив;
			
		КонецЕсли;
		
		ВременныйМассив.Добавить(Элемент);
		
		Счетчик = Счетчик + 1;	
	
	КонецЦикла; 
	
	Если ВременныйМассив.Количество() > 0 Тогда
		Результат.Добавить(ВременныйМассив);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 24.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 15.12.21 УА #40085
Функция ИмяКонфигурации() Экспорт
	Возврат ИС_МП_СерверПовтИсп.ИмяКонфигурации();
КонецФункции //- ИнфоСофт Ивонин К.А. 15.12.21 УА #40085 

//+ ИнфоСофт Ивонин К.А. 31.03.22 УА #44037
Функция ВерсияКонфигурации() Экспорт
	Возврат ИС_МП_СерверПовтИсп.ВерсияКонфигурации();
КонецФункции //- ИнфоСофт Ивонин К.А. 31.03.22 УА #44037

//+ ИнфоСофт Ивонин К.А. 13.02.24 УА #70076
Функция ВерсияБезРедакции() Экспорт
	Возврат ИС_МП_СерверПовтИсп.ВерсияБезРедакции();	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.02.24 УА #70076

////+ ИнфоСофт Ивонин К.А. 07.10.21 УА #38646
//Процедура ОтсортироватьМассив(Массив, Направление = "Возр") Экспорт
//	
//	СписокСортировки = Новый СписокЗначений;
//	СписокСортировки.ЗагрузитьЗначения(Массив);
//	СписокСортировки.СортироватьПоЗначению(НаправлениеСортировки[Направление]);
//	Массив = СписокСортировки.ВыгрузитьЗначения();

//КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 07.07.22 УА #46999
Процедура ЗаписатьВЖРИСообщитьПользователю(Событие, Сообщение) Экспорт
	ОбщегоНазначения.СообщитьПользователю(Сообщение);
	ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , Сообщение);	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.07.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 28.01.21 УА #30203
//
// Функция - Получить ссылку на перечисление
// Пытается получить ссылку на значение указанного перечисления по названию,
// при неудаче возвращает пустую ссылку
//
// Параметры:
//  Перечисление - ПеречислениеСсылка - Объект метаданных конфигурации перечисление 
//  Значение	 - Строка - Искомое перечисление 
// 
// Возвращаемое значение:
// СсылкаНаПеречисление - Возвращает ссылку на найденное по имени значение или пустую ссылку  
//
Функция ЗначениеПеречисленияПоЗначению(Перечисление, Значение) Экспорт

	Результат = Перечисление.ПустаяСсылка();
	
	Попытка
		Результат = Перечисление[Значение];
	Исключение
	КонецПопытки;
	
	Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 28.01.21 УА #30203

//+ ИнфоСофт Ивонин К.А. 31.03.24 УА #71892
Функция ТаблицаЗначенийИзExcel(Адрес, Параметры = Неопределено) Экспорт 
	
	Событие = ИмяСобытия("ТаблицаЗначенийИзExcel");
	
	Если ТипЗнч(Параметры) = Тип("Структура") Тогда
		
		Если Параметры.Свойство("СпособЧтенияЗначений") Тогда
			СпособЧтенияЗначений = Параметры.СпособЧтенияЗначений;
		Иначе
			СпособЧтенияЗначений = СпособЧтенияЗначенийТабличногоДокумента.Текст;		
		КонецЕсли;
		
	КонецЕсли;
	
	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(Адрес);
	Имя = ПолучитьИмяВременногоФайла("xlsx");
	ФайлВременногоХранилища.Записать(Имя);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.Прочитать(Имя, СпособЧтенияЗначений);
	
	Попытка
		УдалитьФайлы(Имя);
	Исключение
		ЗаписатьВЖРИСообщитьПользователю(Событие, "Не удалось удалить временный файл" + Имя);
	КонецПопытки;
	
	ТабличныйДокумент.Область().Разъединить();
	
	ПерваяСтрока = 1;
	ПерваяКолонка = 1;	
	ПоследняяСтрока = ТабличныйДокумент.ВысотаТаблицы;
	ПоследняяКолонка = ТабличныйДокумент.ШиринаТаблицы;
		
	Если ПоследняяСтрока = 0 Тогда	
		ОбщегоНазначения.СообщитьПользователю("Файл excel пуст");
		Возврат Неопределено;	
	КонецЕсли;
	
	Если ТипЗнч(Параметры) = Тип("Структура") Тогда
		
		Если Параметры.Свойство("ПерваяСтрока") Тогда
			ПерваяСтрока = Параметры.ПерваяСтрока;
		КонецЕсли;
		
		Если Параметры.Свойство("ПерваяКолонка") Тогда
			ПерваяКолонка = Параметры.ПерваяКолонка;
		КонецЕсли;
		
		Если Параметры.Свойство("ПоследняяСтрока") Тогда
			ПоследняяСтрока = Параметры.ПоследняяСтрока;
		КонецЕсли;
		
		Если Параметры.Свойство("ПоследняяКолонка") Тогда
			ПоследняяКолонка = Параметры.ПоследняяКолонка;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбластьЯчеек = ТабличныйДокумент.Область(ПерваяСтрока, ПерваяКолонка, ПоследняяСтрока, ПоследняяКолонка);
	
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);
	
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	
	Результат = ПостроительОтчета.Результат.Выгрузить();
	
	Возврат Результат;
		
КонецФункции //- ИнфоСофт Ивонин К.А. 31.03.24 УА #71892

////+ ИнфоСофт Стояк Ю.К. 02.07.2024 УА #78828
//Функция СтрокаВДату(Знач Значение) Экспорт 
//	
//	ПустаяДата = Дата(1, 1, 1);
//	
//	Если Не ЗначениеЗаполнено(Значение) Тогда 
//		Возврат ПустаяДата;
//	КонецЕсли;
//	
//	ОписаниеДаты = Новый ОписаниеТипов("Дата");
//	Дата = ОписаниеДаты.ПривестиЗначение(Значение);
//	
//	Если ТипЗнч(Дата) = Тип("Дата")
//		И ЗначениеЗаполнено(Дата) Тогда 
//		
//		Возврат Дата;
//	КонецЕсли;
//	
//	#Область ПодготовкаЧастейДаты
//	
//	КоличествоСимволов = СтрДлина(Значение);
//	
//	Если КоличествоСимволов > 25 Тогда 
//		Возврат ПустаяДата;
//	КонецЕсли;
//	
//	ЧастиЗначения = Новый Массив;
//	ЧастьЗначения = "";
//	
//	Для НомерСимвола = 1 По КоличествоСимволов Цикл 
//		
//		Символ = Сред(Значение, НомерСимвола, 1);
//		
//		Если ЭтоЧисло(Символ) Тогда 
//			
//			ЧастьЗначения = ЧастьЗначения + Символ;
//			
//		Иначе
//			
//			Если Не ПустаяСтрока(ЧастьЗначения) Тогда 
//				ЧастиЗначения.Добавить(ЧастьЗначения);
//			КонецЕсли;
//			
//			ЧастьЗначения = "";
//			
//		КонецЕсли;
//		
//		Если НомерСимвола = КоличествоСимволов
//			И Не ПустаяСтрока(ЧастьЗначения) Тогда 
//			
//			ЧастиЗначения.Добавить(ЧастьЗначения);
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	Если ЧастиЗначения.Количество() < 3 Тогда 
//		Возврат ПустаяДата;
//	КонецЕсли;
//	
//	Если ЧастиЗначения.Количество() < 4 Тогда 
//		ЧастиЗначения.Добавить("00");
//	КонецЕсли;
//	
//	Если ЧастиЗначения.Количество() < 5 Тогда 
//		ЧастиЗначения.Добавить("00");
//	КонецЕсли;
//	
//	Если ЧастиЗначения.Количество() < 6 Тогда 
//		ЧастиЗначения.Добавить("00");
//	КонецЕсли;
//	
//	#КонецОбласти
//	
//	// Если формат ггггММддЧЧммсс:
//	НормализованноеЗначение = ЧастиЗначения[2] + ЧастиЗначения[1] + ЧастиЗначения[0]
//		+ ЧастиЗначения[3] + ЧастиЗначения[4] + ЧастиЗначения[5];
//	
//	Дата = ОписаниеДаты.ПривестиЗначение(НормализованноеЗначение);
//	
//	Если ТипЗнч(Дата) = Тип("Дата")
//		И ЗначениеЗаполнено(Дата) Тогда 
//		
//		Возврат Дата;
//	КонецЕсли;
//	
//	// Если формат ггггддММЧЧммсс
//	НормализованноеЗначение = ЧастиЗначения[2] + ЧастиЗначения[0] + ЧастиЗначения[1]
//		+ ЧастиЗначения[3] + ЧастиЗначения[4] + ЧастиЗначения[5];
//	
//	Дата = ОписаниеДаты.ПривестиЗначение(НормализованноеЗначение);
//	
//	Если ТипЗнч(Дата) = Тип("Дата")
//		И ЗначениеЗаполнено(Дата) Тогда 
//		
//		Возврат Дата;
//	КонецЕсли;
//	
//	Возврат ПустаяДата;
//	
//КонецФункции //- ИнфоСофт Стояк Ю.К. 02.07.2024 УА #78828

////+ ИнфоСофт Стояк Ю.К. 02.07.2024 УА #78828
//Функция ЭтоЧисло(Знач ПроверяемоеЗначение) Экспорт 
//	
//	Если ПроверяемоеЗначение = "0" Тогда
//		Возврат Истина;
//	КонецЕсли;
//	
//	ОписаниеЧисла = Новый ОписаниеТипов("Число");
//	
//	Возврат ОписаниеЧисла.ПривестиЗначение(ПроверяемоеЗначение) <> 0;
//	
//КонецФункции //- ИнфоСофт Стояк Ю.К. 02.07.2024 УА #78828

//+ ИнфоСофт Ивонин К.А. 06.02.25 УА #92406
Функция ЛокализоватьДату(Дата) Экспорт

	ЧПИБ = ИС_МП_СерверПовтИсп.ЧасовойПоясИнформационнойБазы();
	
	Если ЧПИБ = Неопределено Тогда
		Возврат Дата;
	КонецЕсли;

	ЧПСервера = ЧасовойПояс();    
	
	Если ЧПСервера = ЧПИБ Тогда
		Возврат Дата;
	КонецЕсли;
		                                                   	         
    Возврат МестноеВремя(УниверсальноеВремя(Дата, ЧПСервера), ЧПИБ);

КонецФункции //- ИнфоСофт Ивонин К.А. 06.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 13.04.23 УА #57127
// Останавливает выполнение кода на заданное время.
//
// Параметры:
//  Секунд - Число - время ожидания в секундах.
//
Процедура Пауза(Секунд) Экспорт
	
	ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();
	
	Если ФоновоеЗадание = Неопределено Тогда
		Параметры = Новый Массив;
		Параметры.Добавить(Секунд);
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("ИС_МП_Сервер.Пауза", Параметры);
	КонецЕсли;
		
	ФоновоеЗадание.ОжидатьЗавершенияВыполнения(Секунд);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 20.03.25 УА #96356
Функция УдалитьПустыеЭлементыМассива(Массив) Экспорт

	Результат = Новый Массив;
	
	Для Каждого Элемент Из Массив Цикл

		Если ЗначениеЗаполнено(Элемент) Или Элемент = 0 Тогда
			Результат.Добавить(Элемент);
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 20.03.25 УА #96356

//+ ИнфоСофт Ивонин К.А. 01.04.25 УА #63915
Функция УдалитьНедопустимыеСимволыXML(Знач Стр) Экспорт
	
	Позиция = НайтиНедопустимыеСимволыXML(Стр);

	Пока Позиция > 0 Цикл
		
		Стр = Лев(Стр, Позиция - 1) + Сред(Стр, Позиция + 1);
		Позиция = НайтиНедопустимыеСимволыXML(Стр);
		
	КонецЦикла;

	Возврат Стр;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 01.04.25 УА #63915

#КонецОбласти

#Область РаботаСНастройками

// + ИнфоСофт Ивонин К.А. 02.04.24 УА #71892
//
// Параметры:
//  Профиль			 - СправочникСсылка.ИС_WB_Профили - Профиль 
//  Маркетплейс		 - ПеречислениеСсылка.ИС_МП_Маркетплейсы - Маркетплейс 
//  МассивПараметров - Массив - Массив строчных наименований настроек, которые необходимо получить
//  РежимЧтения		 - Строка - Тип хранения значения: Значение, Строка, Хранилище
// 
// Возвращаемое значение:
//  Структура - Структура содержащая полученнные настройки
//
Функция ПолучитьЗначениеНастроек(Профиль, Маркетплейс, МассивПараметров, РежимЧтения = "Значение") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_MP_Настройки.Параметр КАК Параметр,
	|	ИС_MP_Настройки.&РежимЧтения КАК Значение
	|ИЗ
	|	РегистрСведений.ИС_MP_Настройки КАК ИС_MP_Настройки
	|ГДЕ
	|	ИС_MP_Настройки.Профиль = &Профиль
	|	И ИС_MP_Настройки.Маркетплейс = &Маркетплейс
	|	И ИС_MP_Настройки.Параметр В(&МассивПараметров)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РежимЧтения", РежимЧтения);
	
	Запрос.УстановитьПараметр("Маркетплейс", Маркетплейс);
	Запрос.УстановитьПараметр("МассивПараметров", МассивПараметров);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПараметров = РезультатЗапроса.Выбрать();

	Результат = Новый Структура;
	
	Для Каждого Элемент Из МассивПараметров Цикл
		Результат.Вставить(Элемент, Неопределено);	
	КонецЦикла;

	Пока ВыборкаПараметров.Следующий() Цикл
		Если РежимЧтения = "Хранилище" Тогда
    		Результат[ВыборкаПараметров.Параметр] = ВыборкаПараметров.Значение.Получить();
		Иначе
			Результат[ВыборкаПараметров.Параметр] = ВыборкаПараметров.Значение;
		КонецЕсли;
	КонецЦикла;
		
	Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 02.04.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 02.04.24 УА #71892
//
// Параметры:
//  Профиль			 - СправочникСсылка.ИС_WB_Профили - Профиль 
//  Маркетплейс		 - ПеречислениеСсылка.ИС_МП_Маркетплейсы - Маркетплейс 
//  МассивПараметров - Структура - Структура настроек, которые необходимо записать
//  РежимЧтения		 - Строка - Тип хранения значения: Значение, Строка, Хранилище
// 
// Возвращаемое значение:
//  Булеов - Результат успеха записи
//
Функция ЗаписатьЗначениеНастроек(Профиль, Маркетплейс, СтруктураПараметров, РежимЗаписи = "Значение") Экспорт
		
	Событие = ИмяСобытия("ЗаписатьЗначениеНастроек");
	
	ОбрабатываемаяСтруктура = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураПараметров);
	
	Успех = Истина;
	
	МассивНаименований = Новый Массив;
	
	Для Каждого Элемент Из ОбрабатываемаяСтруктура Цикл
		МассивНаименований.Добавить(Элемент.Ключ);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_MP_Настройки.Параметр КАК Параметр,
	|	ИС_MP_Настройки.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ИС_MP_Настройки КАК ИС_MP_Настройки
	|ГДЕ
	|	ИС_MP_Настройки.Профиль = &Профиль
	|	И ИС_MP_Настройки.Маркетплейс = &Маркетплейс
	|	И ИС_MP_Настройки.Параметр В(&МассивПараметров)";
	
	Запрос.УстановитьПараметр("Маркетплейс", Маркетплейс);
	Запрос.УстановитьПараметр("МассивПараметров", МассивНаименований);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПараметров = РезультатЗапроса.Выбрать();

	Пока ВыборкаПараметров.Следующий() Цикл

		МенеджерЗаписи = РегистрыСведений.ИС_MP_Настройки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Профиль = Профиль;
		МенеджерЗаписи.Маркетплейс = Маркетплейс;
		МенеджерЗаписи.Параметр = ВыборкаПараметров.Параметр;
		
		Если РежимЗаписи = "Значение" Тогда
			МенеджерЗаписи.Значение = ОбрабатываемаяСтруктура[ВыборкаПараметров.Параметр];
		ИначеЕсли РежимЗаписи = "Строка" Тогда
			МенеджерЗаписи.Строка = ОбрабатываемаяСтруктура[ВыборкаПараметров.Параметр];
		ИначеЕсли РежимЗаписи = "Хранилище" Тогда
			МенеджерЗаписи.Хранилище = Новый ХранилищеЗначения(ОбрабатываемаяСтруктура[ВыборкаПараметров.Параметр]);
		Иначе 
			Возврат Ложь;
		КонецЕсли;
			
		Попытка
			МенеджерЗаписи.Записать(Истина);
		Исключение
			Текст = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		    ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			Успех = Ложь;
		КонецПопытки;

		ОбрабатываемаяСтруктура.Удалить(ВыборкаПараметров.Параметр);
	
	КонецЦикла;	
	
	Для Каждого Элемент Из ОбрабатываемаяСтруктура Цикл
	
		МенеджерЗаписи = РегистрыСведений.ИС_MP_Настройки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Профиль = Профиль;
		МенеджерЗаписи.Маркетплейс = Маркетплейс;
		МенеджерЗаписи.Параметр = Элемент.Ключ;
		Если РежимЗаписи = "Значение" Тогда
			МенеджерЗаписи.Значение = Элемент.Значение;
		ИначеЕсли РежимЗаписи = "Строка" Тогда
			МенеджерЗаписи.Строка = Элемент.Значение;
		ИначеЕсли РежимЗаписи = "Хранилище" Тогда
			МенеджерЗаписи.Хранилище = Новый ХранилищеЗначения(Элемент.Значение);
		Иначе
			Возврат Ложь;
		КонецЕсли; 
		
		Попытка
			МенеджерЗаписи.Записать();
		Исключение    
		   	Текст = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		    ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			Успех = Ложь;
		КонецПопытки;
	
	КонецЦикла;
	
	Возврат Успех;

КонецФункции //- ИнфоСофт Ивонин К.А. 02.04.24 УА #71892

#КонецОбласти

//+ ИнфоСофт Ивонин К.А. 13.08.23 УА #61542
Процедура ЗаписатьДанныеОтладки(Профиль, Маркетплейс, ПараметрыЗапроса, РезультатЗапроса) Экспорт
		
	МенеджерЗаписи = РегистрыСведений.ИС_МП_ДанныеОтладки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.Маркетплейс = Маркетплейс;
	
	ЧислоМиллисек = ТекущаяУниверсальнаяДатаВМиллисекундах() / 100000;
	МенеджерЗаписи.Разделитель = (ЧислоМиллисек - Цел(ЧислоМиллисек)) * 100000;

	ПортПоУмолчанию = ?(ПараметрыЗапроса.ЗащищенноеСоединение, ":443", ":80");
	
	Запрос = ?(ПараметрыЗапроса.ЗащищенноеСоединение, "https://", "http://") 
		+ ПараметрыЗапроса.Сервер 
		+ ?(ПараметрыЗапроса.Порт = 0, ПортПоУмолчанию, ":" + ПараметрыЗапроса.Порт)
		+ ПараметрыЗапроса.АдресРесурса;

	МенеджерЗаписи.Запрос = Запрос;
	МенеджерЗаписи.Метод = ПараметрыЗапроса.Метод;
	МенеджерЗаписи.ЗаголовкиЗапроса = ИС_МП_РаботаСHTTPЗапросами.ПолучитьСтрокуJSON(ПараметрыЗапроса.Заголовки); 

	Если ПараметрыЗапроса.ИмяФайлаТела <> Неопределено 
		И ТипЗнч(ПараметрыЗапроса.ИмяФайлаТела) = Тип("Строка")  Тогда

		ТелоЗапроса = СтрШаблон("Файл: %1", ПараметрыЗапроса.ИмяФайлаТела);	

	ИначеЕсли ПараметрыЗапроса.ТелоДвоичныеДанные <> Неопределено 
		И ТипЗнч(ПараметрыЗапроса.ТелоДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
		
		ТелоЗапроса = "ДвоичныеДанные";
		
	ИначеЕсли ПараметрыЗапроса.ТелоСтрока <> Неопределено 
		И ТипЗнч(ПараметрыЗапроса.ТелоСтрока) = Тип("Строка") Тогда
		
		ТелоЗапроса = ПараметрыЗапроса.ТелоСтрока;
	
	Иначе
		ТелоЗапроса = "Тело запроса отсутствует";
	КонецЕсли;  
		
	МенеджерЗаписи.ТелоЗапроса = ТелоЗапроса;
	МенеджерЗаписи.КодОтвета = РезультатЗапроса.КодОтвета;
		
	Если РезультатЗапроса.ЕстьОшибки Тогда	 
		МенеджерЗаписи.ТелоОтвета = ПодробноеПредставлениеОшибки(РезультатЗапроса.ИнформацияОбОшибке);
	Иначе    
	
		МенеджерЗаписи.ЗаголовкиОтвета = ИС_МП_РаботаСHTTPЗапросами.ПолучитьСтрокуJSON(РезультатЗапроса.Заголовки); 
		МенеджерЗаписи.ТелоОтвета = РезультатЗапроса.Ответ;
	
	КонецЕсли;	

	МенеджерЗаписи.Записать(Ложь);	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.08.23 УА #61542

#КонецОбласти 

#Область СлужебныйПрограммныйИнтерфейс

#Область Профили

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Процедура ПолучитьНастройкиМакетплейсов(Форма, Маркетплейс) Экспорт

	ОбщийМодуль = ОбщийМодульМаркетплейса(Маркетплейс);
	ОбщийМодуль.ПолучитьНастройки(Форма);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Процедура ЗаписатьНастройкиМаркетплейсов(Форма, Маркетплейс) Экспорт
	
	ОбщийМодуль = ОбщийМодульМаркетплейса(Маркетплейс);
	ОбщийМодуль.ЗаписатьНастройки(Форма);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 22.10.24 УА #68001
Функция ТестПодключенияМаркетплейсов(Профиль, Маркетплейс, Параметры) Экспорт
	ОбщийМодуль = ОбщийМодульМаркетплейса(Маркетплейс);
	Возврат ОбщийМодуль.ТестПодключения(Профиль, Параметры);	
КонецФункции //- ИнфоСофт Ивонин К.А. 22.10.24 УА #68001

#КонецОбласти

#Область СлужебныйМаркетплейсы

//+ ИнфоСофт Ивонин К.А. 25.10.24 УА #68001
Функция ОбработатьДопПараметрыЗагрузкиТоваров(Маркетплейс, ДопПараметры) Экспорт	
	ОбщийМодуль = ОбщийМодульМаркетплейса(Маркетплейс);
	Возврат ОбщийМодуль.ОбработатьДопПараметрыЗагрузкиТоваров(ДопПараметры);	
КонецФункции //- ИнфоСофт Ивонин К.А. 25.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Функция ТекстЗапросаСопоставления(Маркетплейс) Экспорт
	ОбщийМодуль = ОбщийМодульМаркетплейса(Маркетплейс);
	Возврат ОбщийМодуль.ТекстЗапросаСопоставления();
КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 02.04.25 УА #63915
Функция ПодобратьТовары(Маркетплейс, Профиль, МассивСопоставления, ПараметрыПодбора) Экспорт
	ОбщийМодуль = ОбщийМодульМаркетплейса(Маркетплейс);
	Возврат ОбщийМодуль.ПодобратьТовары(Профиль, МассивСопоставления, ПараметрыПодбора);
КонецФункции //- ИнфоСофт Ивонин К.А. 02.04.25 УА #63915

//+ ИнфоСофт Ивонин К.А. 03.03.25 УА #92887
Функция КоличествоТоваров(Профиль, Маркетплейс) Экспорт	
	ОбщийМодуль = ОбщийМодульМаркетплейса(Маркетплейс);
	Возврат ОбщийМодуль.КоличествоТоваров(Профиль);
КонецФункции //- ИнфоСофт Ивонин К.А. 03.03.25 УА #92887

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Функция ОбщийМодульМаркетплейса(Маркетплейс) Экспорт
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Или Маркетплейс = "ВБ" Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("ИС_ВБ_Сервер");	
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Или Маркетплейс = "Озон" Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("ИС_Ozon_Сервер");
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Или Маркетплейс = "ЯМ" Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("ИС_ЯМ_Сервер");
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Или Маркетплейс = "Сбер" Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("ИС_Сбер_Сервер");
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Или Маркетплейс = "Али" Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("ИС_АЛИ_Сервер");
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.МВМ Или Маркетплейс = "МВМ" Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("ИС_МВМ_Сервер");	
	КонецЕсли;
	
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода Или Маркетплейс = "Ламода" Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("ИС_Ламода_Сервер");	
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
		
	ВызватьИсключение("Неизвестный тип маркетплейса");
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 11.02.23 УА #53535
Функция ИмяСобытия(Имя)
	Возврат СтрШаблон("ИС.МП.ИС_МП_Сервер.%1", Имя);
КонецФункции //- ИнфоСофт Ивонин К.А. 11.02.23 УА #53535
    
#КонецОбласти
